class TermsModel {
  final String title, subTitile;

  TermsModel({required this.title, required this.subTitile});
}

List<TermsModel> termsList = [
  TermsModel(
      title: 'مرحبًا بك في متجر أمان!',
      subTitile: 'باستخدامك للتطبيق، فإنك توافق على هذه الشروط.'),
  TermsModel(
      title: '1. الحسابات',
      subTitile:
          'لإنشاء حساب، يجب تقديم معلومات صحيحة. أنت مسؤول عن حماية حسابك وكلمة المرور.'),
  TermsModel(
      title: '2. المحتوى',
      subTitile:
          'جميع المحتويات داخل التطبيق (الصور، النصوص، إلخ) هي ملك "متجر أمان". لا يمكنك نسخها أو استخدامها بدون إذن.'),
  TermsModel(
      title: '3. الشراء والدفع',
      subTitile:
          'يمكنك شراء المنتجات عبر التطبيق. قد يتم تعديل الأسعار في أي وقت. المنتجات متاحة حسب التوفر.'),
  TermsModel(
      title: '4. الإرجاع والاستبدال',
      subTitile:
          'يمكنك إرجاع أو استبدال المنتجات وفقًا لسياسة الإرجاع لدينا، بشرط أن تكون المنتجات في حالتها الأصلية وغير مستخدمة.'),
  TermsModel(
      title: '5. الخصوصية',
      subTitile:
          'نحترم خصوصيتك. سيتم استخدام معلوماتك الشخصية وفقًا لسياسة الخصوصية.'),
  TermsModel(
      title: '6. الاستخدام القانوني',
      subTitile:
          'يجب استخدام التطبيق بطريقة قانونية فقط. يُمنع استخدامه لأي نشاط غير مشروع.'),
  TermsModel(
      title: '7. التعديلات',
      subTitile:
          'يحق لـ "متجر أمان" تعديل الشروط في أي وقت. سيتم إعلامك بأي تغييرات جديدة.'),
  TermsModel(
      title: '8. الإنهاء', subTitile: 'يمكننا إنهاء حسابك إذا خالفت الشروط.'),
];
